In [21]:
# Magic Jupyter header
%matplotlib inline
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(15.0, 10.0))
plt.style.use('seaborn-whitegrid')
import pandas as pd

# Panda's cheetsheet

### Read data

In [22]:
df1 = pd.read_csv('data/demo_data1.csv')
df1

    name   A   B
0  name1  A1  B1
1  name2  A2  B2

In [23]:
df2 = pd.read_csv('data/demo_data2.csv')
df2

    name     A     С
0  name1  A1_2  C1_2
1  name3  A3_2  C3_2

### Merge data

Help:
- https://pandas.pydata.org/pandas-docs/stable/merging.html

In [37]:
df1 = df1.set_index('name')
df2 = df2.set_index('name')

In [39]:
df1

        A   B
name
name1  A1  B1
name2  A2  B2

In [40]:
df2

          A     С
name
name1  A1_2  C1_2
name3  A3_2  C3_2

In [41]:
frames = [df1, df2]

In [42]:
result = pd.concat(frames, sort=False)
result

          A    B     С
name
name1    A1   B1   NaN
name2    A2   B2   NaN
name1  A1_2  NaN  C1_2
name3  A3_2  NaN  C3_2

In [51]:
result = pd.concat(frames, axis=1, sort=False)
result

         A    B     A     С
name1   A1   B1  A1_2  C1_2
name2   A2   B2   NaN   NaN
name3  NaN  NaN  A3_2  C3_2

In [46]:
result = pd.concat(frames, axis=1, sort=False, join='inner')
result

        A   B     A     С
name
name1  A1  B1  A1_2  C1_2

In [50]:
result = df1.append(df2, sort='False')
result

          A    B     С
name
name1    A1   B1   NaN
name2    A2   B2   NaN
name1  A1_2  NaN  C1_2
name3  A3_2  NaN  C3_2

In [52]:
result = df1.append(df4, ignore_index=True)
result

NameError: name 'df4' is not defined